using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _12_Vball
{
    class Program
    {
        static void Main(string[] args)
        {
      /*      Влади е студент, живее в София и си ходи от време на време до родния град.Той е много запален по волейбола, 
       *      но е зает през работните дни и играе волейбол само през уикендите и в празничните дни.
       *      Влади играе в София всяка събота, когато не е на работа и не си пътува до родния град, 
       *      както и в 2 / 3 от празничните дни.Той пътува до родния си град h пъти в годината, където играе волейбол 
       *      със старите си приятели в неделя. Влади не е на работа 3 / 4 от уикендите, в които е в София. Отделно, 
       *      през високосните години Влади играе с 15 % повече волейбол от нормалното.Приемаме, че годината има точно 48 уикенда, 
       *      подходящи за волейбол.
       *      
                Напишете програма, която изчислява колко пъти Влади е играл волейбол през годината.
 
            Закръглете резултата надолу до най - близкото цяло число (например 2.15  2; 9.95  9).
Входните данни се четат от конзолата:
•	Първият ред съдържа думата “leap” (високосна година) или “normal” (невисокосна).
•	Вторият ред съдържа цялото число p – брой празници в годината (които не са събота и неделя).
•	Третият ред съдържа цялото число h – брой уикенди, в които Влади си пътува до родния град. */
/* 4 8 уикенда в годината, разделени по следния начин:
•	46 уикенда в София  46 * 3 / 4  34.5 съботни игри в София
•	2 уикенда в родния си град  2 недели  2 игри в неделя в родния град
5 празника:
•	5 * 2 / 3  3.333 игри в София в празничен ден
Общо игри през уикенди и празници в София и в родния град: 34.5 + 2 + 3.333  39.833
Годината е високосна:
•	Влади играе допълнителни 15 % *39.833  5.975 игри волейбол
Общо игри през цялата година:
•	39.833 + 5.975 = 45.808 игри
•	Резултатът е 45(закръгля се надолу) */

// normalna godina ====> year - h = q ; q * 3/4 = saturday games
                      // saturday games + p = oshte edni 
                      // p * 2/3 = sushto edni
                      // oshte edni + sushto edni = normalna
// visokosna -----------> normalna * 0.15 = visokosna


            string year = Console.ReadLine().ToLower(); //goodina
            int p = int.Parse(Console.ReadLine()); //praznici v godinata
            int h = int.Parse(Console.ReadLine()); //weekendi do vkushti
            double Normal = (((48 - h) * (3.00f / 4.00f)) + p + (p * (2.00f / 3.00f)));


            double x1 = ((48 - h) * (3.00f / 4.00f));
            double x2 = (p * (2.00f / 3.00f));
            double Leap = (x1 + x2 + h) + ((x1 + x2 + h) * 0.15);

            switch (year)
            {
                case "normal": Console.WriteLine(Math.Truncate(x1 + x2 + h)); break;
                case "leap": Console.WriteLine(Math.Truncate(Leap)); break;
                default: Console.WriteLine("error"); break;
            }

        }
    }
}
